# PANDAS

In [1]:
import pandas as pd

* Series ---- 1d array
* Data Frame ----- 2d array (Table formate , row & col)

In [2]:
a = pd.series([])
b = pd.series([1,2,4,5,65,123])
c = pd.series((45,65,95,35,45))
d = pd.series({'d':10,'B':56,'f':86,'g':66})

AttributeError: module 'pandas' has no attribute 'series'

In [4]:
a = pd.Series([])
b = pd.Series([1,2,4,5,65,123])
c = pd.Series((45,65,95,35,45))
d = pd.Series({'d':10,'b':56,'f':86,'g':66})

C:\Users\priya\AppData\Local\Temp\ipykernel_17864\1938495890.py:1: FutureWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  a = pd.Series([])

In [6]:
d

d    10
b    56
f    86
g    66
dtype: int64

In [8]:
n = pd.array([2,56,4,58,55])

In [9]:
import numpy as np

In [10]:
x = pd.Series(n)

In [11]:
x

0     2
1    56
2     4
3    58
4    55
dtype: Int64

In [13]:
n = np.array([2,56,4,58,55])

In [14]:
x

0     2
1    56
2     4
3    58
4    55
dtype: Int64

In [15]:
d

d    10
b    56
f    86
g    66
dtype: int64

In [20]:
s = pd.Series([12,56,45,78], index=['e','r','t','y'])

In [21]:
s

e    12
r    56
t    45
y    78
dtype: int64

In [22]:
s2 = pd.Series([54,65,65,25,54,52,65,58,45,54])

In [23]:
s2

0    54
1    65
2    65
3    25
4    54
5    52
6    65
7    58
8    45
9    54
dtype: int64

In [25]:
s2.value_counts()

54    3
65    3
25    1
52    1
58    1
45    1
dtype: int64

In [26]:
s2.argmax()

1

In [27]:
s2.argmin()

3

In [28]:
s.idxmax()

'y'

In [29]:
s.idxmin()

'e'

# DATAFRAME

In [34]:
a = pd.DataFrame()
b = pd.DataFrame([1,2,55,40,86], [55,56,44,75,45])

In [31]:
a

Empty DataFrame
Columns: []
Index: []

In [33]:
type(b)

pandas.core.frame.DataFrame

In [35]:
b

     0
55   1
56   2
44  55
75  40
45  86

In [38]:
c = pd.DataFrame([[1,2,3,5,6],[10,20,30,40,50],[7,8,9,10,11],[50,60,70,50,20],[65,95,85,45,25]])

In [37]:
c

    0   1   2
0   1   2   3
1  10  20  30
2   7   8   9

In [39]:
c

    0   1   2   3   4
0   1   2   3   5   6
1  10  20  30  40  50
2   7   8   9  10  11
3  50  60  70  50  20
4  65  95  85  45  25

In [43]:
c.tail(3)

    0   1   2   3   4
2   7   8   9  10  11
3  50  60  70  50  20
4  65  95  85  45  25

In [42]:
c.head(2)

    0   1   2   3   4
0   1   2   3   5   6
1  10  20  30  40  50

In [44]:
c.sample(5)

    0   1   2   3   4
2   7   8   9  10  11
3  50  60  70  50  20
4  65  95  85  45  25
0   1   2   3   5   6
1  10  20  30  40  50

In [49]:
c = pd.DataFrame([[1,2,3,5,6],[10,np.nan,40,50],[7,8,'Missing',11],[50,60,70,50,20],[65,95,85,45]])

In [48]:
c

    0     1   2   3     4
0   1   2.0   3   5   6.0
1  10   NaN  40  50   NaN
2   7   8.0   9  11   NaN
3  50  60.0  70  50  20.0
4  65  95.0  85  45   NaN

In [50]:
c

    0     1        2   3     4
0   1   2.0        3   5   6.0
1  10   NaN       40  50   NaN
2   7   8.0  Missing  11   NaN
3  50  60.0       70  50  20.0
4  65  95.0       85  45   NaN

In [56]:
c = pd.DataFrame([[1,2,3,5,6],[10,np.nan,40,50,],[7,8,'Missing',11,],[50,60,70,50,20],[65,95,85,45,]],columns=['colA','colB','colC','colD','colE'])

In [54]:
c

    0     1        2   3     4
0   1   2.0        3   5   6.0
1  10   NaN       40  50   NaN
2   7   8.0  Missing  11   NaN
3  50  60.0       70  50  20.0
4  65  95.0       85  45   NaN

In [55]:
c

    0     1        2   3     4
0   1   2.0        3   5   6.0
1  10   NaN       40  50   NaN
2   7   8.0  Missing  11   NaN
3  50  60.0       70  50  20.0
4  65  95.0       85  45   NaN

In [57]:
c

   colA  colB     colC  colD  colE
0     1   2.0        3     5   6.0
1    10   NaN       40    50   NaN
2     7   8.0  Missing    11   NaN
3    50  60.0       70    50  20.0
4    65  95.0       85    45   NaN

In [60]:
c.(['colA','colB'])

SyntaxError: invalid syntax (2596972494.py, line 1)

In [61]:
c['colB']

0     2.0
1     NaN
2     8.0
3    60.0
4    95.0
Name: colB, dtype: float64

In [68]:
c[['colB','colC']].head(2)

   colB colC
0   2.0    3
1   NaN   40

In [69]:
c.shape

(5, 5)

In [70]:
c.reshape(6,4)

AttributeError: 'DataFrame' object has no attribute 'reshape'

In [71]:
c['colA'].max()

65

In [73]:
c['new_col'] = [12,52,45,65,45]

In [74]:
-

SyntaxError: invalid syntax (476313318.py, line 1)

In [75]:
c

   colA  colB     colC  colD  colE  new_col
0     1   2.0        3     5   6.0       12
1    10   NaN       40    50   NaN       52
2     7   8.0  Missing    11   NaN       45
3    50  60.0       70    50  20.0       65
4    65  95.0       85    45   NaN       45

In [82]:
c['col_sum'] = c['new_col'] + c['colE']

In [83]:
c

   colA  colB     colC  colD  colE  new_col  col_sum
0     1   2.0        3     5   6.0       12     18.0
1    10   NaN       40    50   NaN       52      NaN
2     7   8.0  Missing    11   NaN       45      NaN
3    50  60.0       70    50  20.0       65     85.0
4    65  95.0       85    45   NaN       45      NaN